# Pandas
## Instruções

Esta tarefa será feita completamente dentro deste _Jupyter notebook_ com as respostas inseridas
nas células fornecidas.
Todos os imports do python que são necessários são mostrados.
Siga as instruções deste _notebook_ para completar as tarefas.
Certifique-se de que os arquivos CSV estão na mesma pasta deste notebook.

In [6]:
# imports necessarios para completar a tarefa
import pandas as pd

## Questao 1: Importar um arquivo CSV
Escreva codigo para carregar o arquivo com dados de ex-alunos, `alumni.csv` em um `DataFrame` pandas chamado de `alumni`.

## Questão 2: Entenda o dataset
Use os seguintes comandos do pandas para visualizar as informações do dataset:
a) head, b) tail, c) dtypes, d) info, e) describe

In [9]:
# questao 1

# Carregue o dataframe para mostrá-lo, após importar o arquivo
alumni = 'alumni.csv'

alumni = pd.read_csv(alumni)

In [ ]:
# a)
alumni.head()

In [15]:
# b)
alumni.tail()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

In [ ]:
# c)
alumni.dtypes

In [ ]:
# d)
alumni.info()

In [63]:
# e)
alumni.describe()

       Year Graduated         Salary           Fee        Savings
count       88.000000      88.000000     88.000000      88.000000
mean      2006.477273   84090.909091  11708.727273   47954.545455
std          1.560852   21234.128008   1110.647949   28324.437721
min       2004.000000   35000.000000  10869.000000    6000.000000
25%       2005.000000   75000.000000  10968.000000   30000.000000
50%       2006.500000   75000.000000  11696.000000   46000.000000
75%       2008.000000   90000.000000  12058.250000   67000.000000
max       2009.000000  160000.000000  20960.000000  146000.000000

## Questao 3: Limpando o dataset (parte A)

a) Use o método `clean_currency` abaixo para limpar as vírculas e os cifrôes da coluna `Savings ($)` e ponha em uma nova coluna chamada `Savings`

In [ ]:
def clean_currency(curr):
    return float(curr.replace(",", "").replace("$", ""))
alumni['Savings'] = alumni['Savings ($)'].apply(clean_currency)

In [20]:
alumni.head()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"

b) execute um `alumni.dtypes.Savings` para verificar se a mudança ocorreu mesmo na tabela

In [ ]:
alumni.dtypes.Savings

## Questão 4: Limpando o data set - parte B

a) Execute o comando `alumni["Gender].value_counts()` para verificar os campos "M" incorretos que devem ser convertidos para "Male"

In [34]:
# a)
alumni["Gender"].value_counts()

Gender
Male      46
Female    39
M          3
Name: count, dtype: int64

b) Agora use um `.replace` na coluna `Gender` para substituir os campos com valores "M" incorretos. _Dica:_ devemos usar `^M$`  para restringir o padrão e capturar somente a string M. Procure a documentação do método `replace` em strings.

In [43]:
# b)
alumni["Gender"] = alumni["Gender"].replace("^M$", "Male", regex=True)

c) O replace não altera a coluna `Gender`. Você deve usar agora uma atribuição `alumni["Gender"] = ` no valor que você fez o replace, para alterar a coluna

In [ ]:
# c)
alumni["Gender"] = alumni["Gender"].replace("^M$", "Male", regex=True)

d) Agora execute o comando `value_counts` novamenta na coluna `Gender` para verificar os valores corretos "Male" e "Female"

In [60]:
# d)
alumni["Gender"].value_counts()

Gender
Male      49
Female    39
Name: count, dtype: int64

## Questão 5: Trabalhando com o data set

a) obtenha a [mediana](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.median.html) (`median`), b) [média](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.mean.html) (`mean`) e c) [desvio padrão](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.std.html) (`std`) para a coluna `Salary`.

In [ ]:
# a)
mediana_salary = alumni["Salary"].median()
print(f"Mediana (median) da coluna 'Salary': {mediana_salary:.2f}")

In [53]:
# b)
media_salary = alumni["Salary"].mean()
print(f"Média (mean) da coluna 'Salary': {media_salary:.2f}")

Média (mean) da coluna 'Salary': 84090.91

In [ ]:
# c)
desvio_padrao_salary = alumni["Salary"].std()
print(f"Desvio Padrão (std) da coluna 'Salary': {desvio_padrao_salary:.2f}")

d) Identifique que aluno pagou mais do que $15000 em taxas usando a coluna `Fee`.

In [64]:
# d)
alunos_mais_de_15000 = alumni[alumni["Fee"] > 15000]
print(alunos_mais_de_15000)

    Year Graduated Gender Marital Status      Diploma Type Defaulted  Salary  \
18            2006   Male        Married  Standard Diploma        No  140000

      Fee Savings ($)  Savings
18  20960     $72,000  72000.0